app/controllers/employees_controller.rb

  def index
    # binding.pry
    render json: Employee.all.select(:id, :firstname)
---
SELECT "employees"."id", "employees"."firstname" FROM "employees"

  def create
    employee = Employee.create(employee_params)
---
INSERT INTO "employees" ("firstname", "created_at", "updated_at") VALUES (?, ?, ?)  [["firstname", "asdsada"], ["created_at", "2018-01-09 12:45:33.678759"], ["updated_at", "2018-01-09 12:45:33.678759"]]

  def update
    employee = Employee.find_by_id(params[:id])
    employee.update(employee_params)
---
SELECT  "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "employees" SET "firstname" = ?, "updated_at" = ? WHERE "employees"."id" = ?  [["firstname", "Raman1"], ["updated_at", "2018-01-09 13:32:24.826118"], ["id", 2]]

  def destroy
    employee = Employee.find_by_id(params[:id])
    employee.destroy!
---
SELECT  "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "employees" WHERE "employees"."id" = ?  [["id", 1]]